PreProcessing/modules/tunnelToCurvedPlateModule/tunnelCase/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../constant/inputParam"

Uinf            ${flowParam.freeStreamVelocityStreamwise};
Winf            ${flowParam.freeStreamVelocitySpanwise};
Ti              ${flowParam.turbulenceIntensity};

Umag            #calc "sqrt($Uinf*$Uinf + $Winf*$Winf)";
kInlet          #calc "1.5 * pow($Umag * $Ti, 2)";

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    airfoil
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    upperWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    lowerWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
