PreProcessing/modules/tunnelToCurvedPlateModule/tunnelCase/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            (sampling);

interpolationScheme cellPoint;
setFormat       raw;

fields          (U p);

sets
{
    suctionOutletProbes
    {
        type    cloud;
        axis    xyz;
        points
        (
            (-0.004256766007 0.08076307629 0.005)
            (-0.004257997134 0.080781719 0.005)
            (-0.004259244718 0.08080061092 0.005)
            (-0.004260508979 0.08081975537 0.005)
            (-0.004261790139 0.08083915575 0.005)
            (-0.004263088427 0.08085881546 0.005)
            (-0.00426440407 0.08087873797 0.005)
            (-0.004265737299 0.08089892679 0.005)
            (-0.00426708835 0.08091938549 0.005)
            (-0.00426845746 0.08094011768 0.005)
            (-0.004269844873 0.08096112699 0.005)
            (-0.004271250833 0.08098241716 0.005)
            (-0.004272675586 0.08100399192 0.005)
            (-0.004274119386 0.08102585508 0.005)
            (-0.004275582485 0.0810480105 0.005)
            (-0.004277065141 0.08107046208 0.005)
            (-0.004278567618 0.08109321379 0.005)
            (-0.004280090179 0.08111626963 0.005)
            (-0.004281633093 0.08113963367 0.005)
            (-0.004283196632 0.08116331003 0.005)
            (-0.004284781071 0.08118730289 0.005)
            (-0.004286386691 0.08121161646 0.005)
            (-0.004288013774 0.08123625506 0.005)
            (-0.004289662606 0.08126122301 0.005)
            (-0.00429133348 0.08128652473 0.005)
            (-0.00429302669 0.08131216466 0.005)
            (-0.004294742532 0.08133814733 0.005)
            (-0.004296481312 0.08136447734 0.005)
            (-0.004298243336 0.08139115931 0.005)
            (-0.004300028913 0.08141819795 0.005)
            (-0.004301838359 0.08144559803 0.005)
            (-0.004303671992 0.08147336438 0.005)
            (-0.004305530137 0.08150150191 0.005)
            (-0.004307413121 0.08153001556 0.005)
            (-0.004309321276 0.08155891037 0.005)
            (-0.004311254938 0.08158819143 0.005)
            (-0.004313214448 0.08161786391 0.005)
            (-0.004315200152 0.08164793304 0.005)
            (-0.0043172124 0.08167840411 0.005)
            (-0.004319251547 0.08170928251 0.005)
            (-0.004321317952 0.08174057368 0.005)
            (-0.00432341198 0.08177228313 0.005)
            (-0.004325534001 0.08180441647 0.005)
            (-0.004327684387 0.08183697935 0.005)
            (-0.004329863519 0.0818699775 0.005)
            (-0.004332071781 0.08190341677 0.005)
            (-0.004334309561 0.08193730304 0.005)
            (-0.004336577255 0.08197164229 0.005)
            (-0.004338875262 0.08200644056 0.005)
            (-0.004341203989 0.082041704 0.005)
            (-0.004343563845 0.08207743884 0.005)
            (-0.004345955245 0.08211365135 0.005)
            (-0.004348378614 0.08215034794 0.005)
            (-0.004350834377 0.08218753507 0.005)
            (-0.004353322968 0.0822252193 0.005)
            (-0.004355844824 0.08226340729 0.005)
            (-0.004358400392 0.08230210575 0.005)
            (-0.004360990121 0.08234132151 0.005)
            (-0.004363614469 0.08238106149 0.005)
            (-0.004366273898 0.08242133269 0.005)
            (-0.004368968877 0.08246214223 0.005)
            (-0.004371699881 0.08250349729 0.005)
            (-0.004374467392 0.08254540516 0.005)
            (-0.004377271898 0.08258787324 0.005)
            (-0.004380113893 0.08263090901 0.005)
            (-0.004382993879 0.08267452007 0.005)
            (-0.004385912363 0.0827187141 0.005)
            (-0.004388869859 0.08276349889 0.005)
            (-0.004391866891 0.08280888235 0.005)
            (-0.004394903986 0.08285487247 0.005)
            (-0.004397981678 0.08290147737 0.005)
            (-0.004401100512 0.08294870526 0.005)
            (-0.004404261038 0.08299656447 0.005)
            (-0.004407463812 0.08304506344 0.005)
            (-0.004410709399 0.08309421072 0.005)
            (-0.004413998371 0.08314401499 0.005)
            (-0.00441733131 0.08319448501 0.005)
            (-0.004420708801 0.0832456297 0.005)
            (-0.004424131441 0.08329745806 0.005)
            (-0.004427599833 0.08334997924 0.005)
            (-0.00443111459 0.0834032025 0.005)
            (-0.00443467633 0.08345713723 0.005)
            (-0.004438285681 0.08351179294 0.005)
            (-0.004441943281 0.08356717925 0.005)
            (-0.004445649774 0.08362330594 0.005)
            (-0.004449405814 0.08368018291 0.005)
            (-0.004453212063 0.08373782019 0.005)
            (-0.004457069192 0.08379622793 0.005)
            (-0.004460977882 0.08385541644 0.005)
            (-0.004464938821 0.08391539616 0.005)
            (-0.004468952707 0.08397617766 0.005)
            (-0.004473020251 0.08403777166 0.005)
            (-0.004477142166 0.08410018902 0.005)
            (-0.004481319182 0.08416344075 0.005)
            (-0.004485552034 0.084227538 0.005)
            (-0.00448984147 0.08429249207 0.005)
            (-0.004494188244 0.08435831441 0.005)
            (-0.004498593124 0.08442501665 0.005)
            (-0.004503056887 0.08449261052 0.005)
...
        );
    }
    pressureOutletProbes
    {
        type    cloud;
        axis    xyz;
        points
        (
            (-0.3755363142 -0.05674255038 0.005)
            (-0.3755399757 -0.0567608714 0.005)
            (-0.3755436863 -0.05677943732 0.005)
            (-0.3755474463 -0.05679825142 0.005)
            (-0.3755512566 -0.05681731702 0.005)
            (-0.375555118 -0.05683663748 0.005)
            (-0.3755590308 -0.05685621621 0.005)
            (-0.3755629961 -0.05687605665 0.005)
            (-0.3755670143 -0.05689616231 0.005)
            (-0.3755710862 -0.05691653674 0.005)
            (-0.3755752125 -0.05693718352 0.005)
            (-0.3755793941 -0.05695810631 0.005)
            (-0.3755836314 -0.05697930878 0.005)
            (-0.3755879255 -0.05700079466 0.005)
            (-0.3755922769 -0.05702256778 0.005)
            (-0.3755966866 -0.05704463194 0.005)
            (-0.3756011551 -0.05706699104 0.005)
            (-0.3756056834 -0.05708964902 0.005)
            (-0.3756102722 -0.05711260989 0.005)
            (-0.3756149224 -0.05713587769 0.005)
            (-0.3756196348 -0.05715945653 0.005)
            (-0.3756244101 -0.05718335055 0.005)
            (-0.3756292493 -0.05720756399 0.005)
            (-0.3756341531 -0.05723210109 0.005)
            (-0.3756391225 -0.0572569662 0.005)
            (-0.3756441583 -0.05728216369 0.005)
            (-0.3756492615 -0.05730769801 0.005)
            (-0.3756544328 -0.05733357365 0.005)
            (-0.3756596734 -0.0573597952 0.005)
            (-0.3756649839 -0.05738636727 0.005)
            (-0.3756703654 -0.05741329453 0.005)
            (-0.375675819 -0.05744058175 0.005)
            (-0.3756813453 -0.05746823373 0.005)
            (-0.3756869455 -0.05749625535 0.005)
            (-0.3756926206 -0.05752465155 0.005)
            (-0.3756983716 -0.05755342734 0.005)
            (-0.3757041994 -0.05758258779 0.005)
            (-0.3757101052 -0.05761213804 0.005)
            (-0.3757160899 -0.05764208331 0.005)
            (-0.3757221546 -0.05767242887 0.005)
            (-0.3757283004 -0.05770318008 0.005)
            (-0.3757345283 -0.05773434236 0.005)
            (-0.3757408395 -0.0577659212 0.005)
            (-0.375747235 -0.05779792217 0.005)
            (-0.3757537161 -0.05783035092 0.005)
            (-0.3757602837 -0.05786321316 0.005)
            (-0.3757669391 -0.05789651468 0.005)
            (-0.3757736836 -0.05793026137 0.005)
            (-0.3757805182 -0.05796445916 0.005)
            (-0.3757874441 -0.0579991141 0.005)
            (-0.3757944626 -0.05803423229 0.005)
            (-0.375801575 -0.05806981993 0.005)
            (-0.3758087825 -0.05810588327 0.005)
            (-0.3758160862 -0.0581424287 0.005)
            (-0.3758234876 -0.05817946266 0.005)
            (-0.375830988 -0.05821699167 0.005)
            (-0.3758385886 -0.05825502235 0.005)
            (-0.3758462907 -0.0582935614 0.005)
            (-0.3758540959 -0.05833261563 0.005)
            (-0.3758620054 -0.05837219191 0.005)
            (-0.3758700206 -0.05841229724 0.005)
            (-0.3758781431 -0.05845293867 0.005)
            (-0.375886374 -0.05849412339 0.005)
            (-0.3758947149 -0.05853585863 0.005)
            (-0.3759031674 -0.05857815178 0.005)
            (-0.3759117329 -0.05862101028 0.005)
            (-0.3759204128 -0.0586644417 0.005)
            (-0.3759292088 -0.05870845369 0.005)
            (-0.3759381224 -0.05875305401 0.005)
            (-0.3759471551 -0.05879825052 0.005)
            (-0.3759563086 -0.05884405121 0.005)
            (-0.3759655844 -0.05889046414 0.005)
            (-0.3759749843 -0.05893749749 0.005)
            (-0.3759845097 -0.05898515957 0.005)
            (-0.3759941625 -0.05903345876 0.005)
            (-0.3760039444 -0.05908240361 0.005)
            (-0.376013857 -0.05913200272 0.005)
            (-0.3760239021 -0.05918226485 0.005)
            (-0.3760340815 -0.05923319887 0.005)
            (-0.376044397 -0.05928481374 0.005)
            (-0.3760548503 -0.05933711859 0.005)
            (-0.3760654434 -0.05939012261 0.005)
            (-0.3760761782 -0.05944383517 0.005)
            (-0.3760870564 -0.05949826574 0.005)
            (-0.37609808 -0.05955342392 0.005)
            (-0.376109251 -0.05960931942 0.005)
            (-0.3761205712 -0.0596659621 0.005)
            (-0.3761320429 -0.05972336196 0.005)
            (-0.3761436678 -0.05978152911 0.005)
            (-0.3761554482 -0.05984047382 0.005)
            (-0.376167386 -0.05990020648 0.005)
            (-0.3761794834 -0.05996073761 0.005)
            (-0.3761917425 -0.06002207789 0.005)
            (-0.3762041656 -0.06008423815 0.005)
            (-0.3762167547 -0.06014722933 0.005)
            (-0.376229512 -0.06021106256 0.005)
            (-0.3762424399 -0.06027574908 0.005)
            (-0.3762555406 -0.06034130029 0.005)
            (-0.3762688164 -0.06040772777 0.005)
...
        );
    }
    farfieldProbes
    {
        type    cloud;
        axis    xyz;
        points
        (
            (-0.04160311256 0.6395058738 0.005)
            (-0.04160311256 0.6395058738 0.005)
            (-0.04249524939 0.6394441965 0.005)
            (-0.04249524939 0.6394441965 0.005)
            (-0.04338738621 0.6393825192 0.005)
            (-0.04338738621 0.6393825192 0.005)
            (-0.04427952303 0.639320842 0.005)
            (-0.04427952303 0.639320842 0.005)
            (-0.04517173016 0.6392601996 0.005)
            (-0.04517173016 0.6392601996 0.005)
            (-0.04606400427 0.6392005421 0.005)
            (-0.04606400427 0.6392005421 0.005)
            (-0.04695625918 0.6391405988 0.005)
            (-0.04695625918 0.6391405988 0.005)
            (-0.04784848355 0.6390802023 0.005)
            (-0.04784848355 0.6390802023 0.005)
            (-0.0487406818 0.6390194212 0.005)
            (-0.0487406818 0.6390194212 0.005)
            (-0.04963284826 0.6389581756 0.005)
            (-0.04963284826 0.6389581756 0.005)
            (-0.05052498775 0.6388965375 0.005)
            (-0.05052498775 0.6388965375 0.005)
            (-0.05141709416 0.6388344236 0.005)
            (-0.05141709416 0.6388344236 0.005)
            (-0.05230917272 0.6387719095 0.005)
            (-0.05230917272 0.6387719095 0.005)
            (-0.05320121689 0.6387089083 0.005)
            (-0.05320121689 0.6387089083 0.005)
            (-0.05409322803 0.6386454392 0.005)
            (-0.05409322803 0.6386454392 0.005)
            (-0.05498520771 0.6385815314 0.005)
            (-0.05498520771 0.6385815314 0.005)
            (-0.05587715162 0.638517125 0.005)
            (-0.05587715162 0.638517125 0.005)
            (-0.05676906451 0.6384522915 0.005)
            (-0.05676906451 0.6384522915 0.005)
            (-0.05766094023 0.6383869481 0.005)
            (-0.05766094023 0.6383869481 0.005)
            (-0.05855278394 0.63832117 0.005)
            (-0.05855278394 0.63832117 0.005)
            (-0.05944458908 0.6382548706 0.005)
            (-0.05944458908 0.6382548706 0.005)
            (-0.06033636122 0.6381881286 0.005)
            (-0.06033636122 0.6381881286 0.005)
            (-0.06122809329 0.6381208541 0.005)
            (-0.06122809329 0.6381208541 0.005)
            (-0.06211979135 0.6380531295 0.005)
            (-0.06211979135 0.6380531295 0.005)
            (-0.06301144785 0.6379848608 0.005)
            (-0.06301144785 0.6379848608 0.005)
            (-0.0639030693 0.6379161343 0.005)
            (-0.0639030693 0.6379161343 0.005)
            (-0.06479464763 0.6378468524 0.005)
            (-0.06479464763 0.6378468524 0.005)
            (-0.06568618629 0.6377770596 0.005)
            (-0.06568618629 0.6377770596 0.005)
            (-0.06657770569 0.637707022 0.005)
            (-0.06657770569 0.637707022 0.005)
            (-0.06746920475 0.6376367253 0.005)
            (-0.06746920475 0.6376367253 0.005)
            (-0.06836070271 0.6375664149 0.005)
            (-0.06836070271 0.6375664149 0.005)
            (-0.06925220069 0.6374961044 0.005)
            (-0.06925220069 0.6374961044 0.005)
            (-0.07014369867 0.6374257939 0.005)
            (-0.07014369867 0.6374257939 0.005)
            (-0.07103519664 0.6373554834 0.005)
            (-0.07103519664 0.6373554834 0.005)
            (-0.07192669461 0.6372851729 0.005)
            (-0.07192669461 0.6372851729 0.005)
            (-0.07281819257 0.6372148625 0.005)
            (-0.07281819257 0.6372148625 0.005)
            (-0.07370967758 0.6371443885 0.005)
            (-0.07370967758 0.6371443885 0.005)
            (-0.07460112752 0.6370734726 0.005)
            (-0.07460112752 0.6370734726 0.005)
            (-0.07549255005 0.6370022124 0.005)
            (-0.07549255005 0.6370022124 0.005)
            (-0.07638392857 0.6369304056 0.005)
            (-0.07638392857 0.6369304056 0.005)
            (-0.07727526836 0.6368581174 0.005)
            (-0.07727526836 0.6368581174 0.005)
            (-0.07816656666 0.6367853214 0.005)
            (-0.07816656666 0.6367853214 0.005)
            (-0.07905782175 0.6367119964 0.005)
            (-0.07905782175 0.6367119964 0.005)
            (-0.0799490412 0.6366382412 0.005)
            (-0.0799490412 0.6366382412 0.005)
            (-0.08084021828 0.6365639747 0.005)
            (-0.08084021828 0.6365639747 0.005)
            (-0.08173136035 0.6364892901 0.005)
            (-0.08173136035 0.6364892901 0.005)
            (-0.08262246097 0.636414112 0.005)
            (-0.08262246097 0.636414112 0.005)
            (-0.08351352723 0.636338528 0.005)
            (-0.08351352723 0.636338528 0.005)
            (-0.08440455301 0.6362624682 0.005)
            (-0.08440455301 0.6362624682 0.005)
            (-0.0852955451 0.6361860144 0.005)
...
        );
    }
}

// ************************************************************************* //
